###################################################################

# Created by write_sdc on Sat Jun 27 22:14:51 2026

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_driving_cell -lib_cell INVX1_RVT [get_ports rst_n]
set_driving_cell -lib_cell INVX1_RVT [get_ports {a[7]}]
set_driving_cell -lib_cell INVX1_RVT [get_ports {a[6]}]
set_driving_cell -lib_cell INVX1_RVT [get_ports {a[5]}]
set_driving_cell -lib_cell INVX1_RVT [get_ports {a[4]}]
set_driving_cell -lib_cell INVX1_RVT [get_ports {a[3]}]
set_driving_cell -lib_cell INVX1_RVT [get_ports {a[2]}]
set_driving_cell -lib_cell INVX1_RVT [get_ports {a[1]}]
set_driving_cell -lib_cell INVX1_RVT [get_ports {a[0]}]
set_driving_cell -lib_cell INVX1_RVT [get_ports {b[7]}]
set_driving_cell -lib_cell INVX1_RVT [get_ports {b[6]}]
set_driving_cell -lib_cell INVX1_RVT [get_ports {b[5]}]
set_driving_cell -lib_cell INVX1_RVT [get_ports {b[4]}]
set_driving_cell -lib_cell INVX1_RVT [get_ports {b[3]}]
set_driving_cell -lib_cell INVX1_RVT [get_ports {b[2]}]
set_driving_cell -lib_cell INVX1_RVT [get_ports {b[1]}]
set_driving_cell -lib_cell INVX1_RVT [get_ports {b[0]}]
set_load -pin_load 0.005 [get_ports {q_out[7]}]
set_load -pin_load 0.005 [get_ports {q_out[6]}]
set_load -pin_load 0.005 [get_ports {q_out[5]}]
set_load -pin_load 0.005 [get_ports {q_out[4]}]
set_load -pin_load 0.005 [get_ports {q_out[3]}]
set_load -pin_load 0.005 [get_ports {q_out[2]}]
set_load -pin_load 0.005 [get_ports {q_out[1]}]
set_load -pin_load 0.005 [get_ports {q_out[0]}]
create_clock [get_ports clk]  -period 1.5  -waveform {0 0.75}
set_clock_uncertainty 0.075  [get_clocks clk]
set_input_delay -clock clk  0.3  [get_ports rst_n]
set_input_delay -clock clk  0.3  [get_ports {a[7]}]
set_input_delay -clock clk  0.3  [get_ports {a[6]}]
set_input_delay -clock clk  0.3  [get_ports {a[5]}]
set_input_delay -clock clk  0.3  [get_ports {a[4]}]
set_input_delay -clock clk  0.3  [get_ports {a[3]}]
set_input_delay -clock clk  0.3  [get_ports {a[2]}]
set_input_delay -clock clk  0.3  [get_ports {a[1]}]
set_input_delay -clock clk  0.3  [get_ports {a[0]}]
set_input_delay -clock clk  0.3  [get_ports {b[7]}]
set_input_delay -clock clk  0.3  [get_ports {b[6]}]
set_input_delay -clock clk  0.3  [get_ports {b[5]}]
set_input_delay -clock clk  0.3  [get_ports {b[4]}]
set_input_delay -clock clk  0.3  [get_ports {b[3]}]
set_input_delay -clock clk  0.3  [get_ports {b[2]}]
set_input_delay -clock clk  0.3  [get_ports {b[1]}]
set_input_delay -clock clk  0.3  [get_ports {b[0]}]
set_output_delay -clock clk  0.3  [get_ports {q_out[7]}]
set_output_delay -clock clk  0.3  [get_ports {q_out[6]}]
set_output_delay -clock clk  0.3  [get_ports {q_out[5]}]
set_output_delay -clock clk  0.3  [get_ports {q_out[4]}]
set_output_delay -clock clk  0.3  [get_ports {q_out[3]}]
set_output_delay -clock clk  0.3  [get_ports {q_out[2]}]
set_output_delay -clock clk  0.3  [get_ports {q_out[1]}]
set_output_delay -clock clk  0.3  [get_ports {q_out[0]}]
